# FPenPat

## Description
Deprecated - will generate error. Use FPenPatN instead.&lt;BR&gt;

```pascal
FUNCTION FPenPat : INTEGER;
```

```python

def vs.FPenPat():
    return INTEGER
```

## Remarks
Deprecated - will generate error. Use FPenPatN instead. Original description was: Function FPenPat returns the active pen pattern setting.

## Examples
```pascal
CurrPenStyle:=FPenPat;

```

## See Also
VS Functions:
FPenPatN

## Version
```diff
- FPenPat is obsolete as of Vectorworks 2013
```

Availability: from MiniCAD
## Category
* Document Attributes